Autodesk.Revit.DB.PointClouds.PointCloudOverrides.SetPointCloudOverrideSettings(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings,System.String,Autodesk.Revit.DB.Document)
Assigns override settings to a particular scan within a PointCloudInstance element.
elementId:
Id of the element to be overridden.
newSettings:
Override settings to be assigned.
scanTag:
The tag identifying the particular scan within the PointCloudInstance element.
Tags can be obtained from PointCloudInstance via method getScans.
doc:
Document containing the element to be overridden.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when supplied scanTag is not empty while doc is NULL
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The override settings are not valid.
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrides.GetPointCloudOverrideSettings(Autodesk.Revit.DB.ElementId,System.String,Autodesk.Revit.DB.Document)
Gets override settings assigned to a particular scan within a PointCloudInstance element.
elementId:
Id of the overridden element.
scanTag:
The tag identifying the particular scan within the PointCloudInstance element.
Tags can be obtained from PointCloudInstance via method getScans.
doc:
Document containing the overridden element.
Returns:
The override settings assigned to the scan, if present, or a default override settings if nothing was found.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when supplied scanTag is not empty while doc is NULL
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrides.SetPointCloudOverrideSettings(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings)
Assigns override settings to the whole PointCloudInstance element.
elementId:
Id of the element to be overridden.
newSettings:
Override settings to be assigned.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrides.GetPointCloudOverrideSettings(Autodesk.Revit.DB.ElementId)
Gets override settings assigned to the whole PointCloudInstance element.
elementId:
Id of the overridden element.
Returns:
The override settings assigned to the element, if present, or a default override settings if nothing was found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014